// Preparing data  
let root = {
    "name": "श्री हृदयी राम",
    "info": "Anscester",
    "children": [
    {
        "name": "श्री शिव दास",
        "children": [
        {
            "name": "श्री गणेश"
        },
        {
            "name": "श्री राम गरीब"
        }
        ]
    },
    {
        "name": "श्री शिव पाल",
        "children": [
        {
            "name": "श्री बेनी माधव",
            "children": [
            {
                "name": "राम अधीन",
                "children": [
                {
                    "name": "महादेव"
                },
                {
                    "name": "रामेश्वर"
                }
                ]
            },
            {
                "name": "राम सेवक",
                "children": [
                    {
                        "name": "बिन्द्रा राम",
                        "children": [
                        {
                            "name": "राम विशाल",
                            "children": [
                            {
                                "name": "शिव प्रसाद",
                                "children": [
                                {
                                    "name": "रमेश"
                                },
                                {
                                    "name": "राम नरेश",
                                    "children": [
                                    {
                                        "name": "संजय"
                                    },
                                    {
                                        "name": "विजय"
                                    }
                                    ]
                                },
                                {
                                    "name": "दीनेश",
                                    "children": [
                                        {
                                            "name": "नीरज"
                                        },
                                        {
                                            "name": "नीलेश"
                                        },
                                        {
                                            "name": "दीपेश"
                                        },
                                        {
                                            "name": "रोहित"
                                        }
                                    ]
                                }
                                ]
                            },
                            {
                                "name": "राम नेवाज",
                                "children": [
                                {
                                    "name": "राज कुमार",
                                    "children": [
                                        {
                                            "name": "अभिषेक"
                                        },
                                        {
                                            "name": "अनुराग"
                                        },
                                        {
                                            "name": "3"
                                        }
                                    ]
                                }
                                ]
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "बद्री राम"
                    }
                ]

            },
            {
                "name": "श्री सूर्य दीन गौतम",
                "children": [
                {
                    "name": "श्री विश्वेश्वर राम",
                    "children": [
                    {
                        "name": "श्री मनबहोर"
                    },
                    {
                        "name": "श्री लक्ष्मण प्रसाद",
                        "children": [
                        {
                            "name": "इंद्रकली(पुत्री)"
                        },
                        {
                            "name": "श्री सुरेश प्रसाद गौतम",
                            "children": [
                            {
                                "name": "सुनीता(पुत्री)"
                            },
                            {
                                "name": "दीपक",
                                "children": [
                                {
                                    "name": "आयुष"
                                },
                                {
                                    "name": "प्राची(पुत्री)"
                                }
                                ]
                            },
                            {
                                "name": "आनंद",
                                "children": [
                                {
                                    "name": "1(पुत्री)"
                                },
                                {
                                    "name": "2(पुत्री)"
                                }
                                ]
                            },
                            {
                                "name": "अनंत",
                                "children": [
                                    {
                                        "name": "1"
                                    },
                                    {
                                        "name": "2 (पुत्री)"
                                    }
                                ]
                            }
                            ]
                        },
                        {
                            "name": "श्री केशरी प्रसाद गौतम",
                            "children": [
                                {
                                    "name": "सुधा मिश्रा (शुक्ला)"
                                },
                                {
                                    "name": "आराधना मिश्रा (शुक्ला)"
                                },
                                {
                                    "name": "अर्चना मिश्रा (शुक्ला)"
                                },
                                {
                                    "name": "आरती मिश्रा (शुक्ला) (शिक्षक)"
                                },
                                {
                                    "name": "आशुतोष मिश्र",
                                    "children": [
                                        {
                                            "name": "आद्या मिश्रा"
                                        }
                                    ]
                                },
                                {
                                    "name": "आदर्श मिश्र(भूपे)",
                                    "children": [
                                        {
                                            "name": "आव्या मिश्रा"
                                        }
                                    ]
                                }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "श्री मनमोहन"
                    }
                    ]
                }
                ]
            },
            {
                "name": "श्री आनंदे राम",
                "children": [
                {
                    "name": "श्री फदाली राम"
                },
                {
                    "name": "श्री नर्वदा राम",
                    "children": [
                    {
                        "name": "श्री बलदेव"
                    },
                    {
                        "name": "श्री राम जीवन",
                        "children": [
                        {
                            "name": "श्री श्रीनिवास",
                            "children": [
                            {
                                "name": "पूनम(पुत्री)"
                            },
                            {
                                "name": "पूजा(पुत्री)"
                            },
                            {
                                "name": "त्रयंबक(पुत्र)"
                            },
                            {
                                "name": "पलक(पुत्री)"
                            },
                            {
                                "name": "झलक(पुत्री)"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "श्री यज्ञ नारायण गौतम",
                        "children": [
                        {
                            "name": "गुड्डी(पुत्री)"
                        },
                        {
                            "name": "राकेश",
                            "children": [
                                {
                                    "name": "ऋषभ"
                                },
                                {
                                    "name": "1"
                                }
                            ]
                        },
                        {
                            "name": "पवन",
                            "children": [
                                {
                                    "name": "देवांश"
                                }
                            ]
                        },
                        {
                            "name": "घनश्‍याम",
                            "children": [
                                {
                                    "name": "दिव्यांश"
                                }
                            ]
                        },
                        {
                            "name": "पंकज (पुत्री)"
                        },
                        ]
                    },
                    {
                        "name": "श्री राम नारायण"
                    }
                    ]
                }
                ]
            },
            {
                "name": "श्री परम सुख",
                "children": [
                {
                    "name": "जमुनाराम",
                    "children": [
                    {
                        "name": "जगदीश प्रसाद",
                        "children": [
                            {
                                "name": "मांडवी(पुत्री)"
                            }
                        ]
                    },
                    {
                        "name": "राम गोपाल",
                        "children": [
                        {
                            "name": "श्री संपाती/सम्पति",
                            "children": [
                                {
                                    "name": "वर्षा(पुत्री)"
                                },
                                {
                                    "name": "सुषमा(पुत्री)"
                                },
                                {
                                    "name": "सुमन(पुत्री)"
                                },
                                {
                                    "name": "ओम प्रकाश"
                                },
                                {
                                    "name": "जय प्रकाश"
                                }
                            ]
                        },
                        {
                            "name": "श्री दयाशंकर",
                            "children": [
                                {
                                    "name": "मीरा(पुत्री)"
                                },
                                {
                                    "name": "अजय",
                                    "children": [
                                    {
                                        "name": "पार्थ(पुत्र)"
                                    }
                                    ],
                                },
                                {
                                    "name": "राधा(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "श्री रावेंद्र",
                            "children": [
                            {
                                "name": "शालू(पुत्री)"
                            },
                            {
                                "name": "सौरभ"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "राम मिलन",
                        "children": [
                        {
                            "name": "गिरिजा",
                            "children": [
                                {
                                    "name": "विवेक"
                                },
                                {
                                    "name": "अभिषेक"
                                }
                            ]
                        },
                        {
                            "name": "शिव शंकर",
                            "children": [
                                {
                                    "name": "आदित्य"
                                },
                                {
                                    "name": "नेहा(पुत्री)"
                                }
                            ]
                        }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        },
        {
            "name": "श&#2381;र&#2368; ग&#2306;ग&#2366; र&#2366;म",
            "children": [
            {
                "name": "श&#2381;र&#2368; नन&#2381;द क&#2367;श&#2379;र",
                "children": [
                {
                    "name": "श&#2381;र&#2368; श&#2379;भन&#2366;थ(1)",
                    "children": [
                    {
                        "name": "च&#2306;द&#2381;र श&#2375;खर",
                        "children": [
                        {
                            "name": "श&#2375;षमण&#2367;",
                            "children": [
                            {
                                "name": "मह&#2375;न&#2381;द&#2381;र",
                                "children": [
                                {
                                    "name": "न&#2375;ह&#2366;(प&#2369;त&#2381;र&#2368;)"
                                },
                                {
                                    "name": "न&#2367;ख&#2367;ल"
                                },
                                {
                                    "name": "न&#2368;त&#2375;श"
                                }
                                ]
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "शम&#2381;भ&#2370;",
                        "children": [
                        {
                            "name": "इन&#2381;द&#2381;रस&#2375;न (-1)"
                        }
                        ]
                    }
                    ]
                },
                {
                    "name": "श&#2381;र&#2368; र&#2366;म प&#2381;रग&#2366;स(1)",
                    "children": [
                    {
                        "name": "श&#2369;भउव&#2366;(प&#2369;त&#2381;र&#2368;)"
                    },
                    {
                        "name": "रजन&#2368;(प&#2369;त&#2381;र&#2368;)"
                    }
                    ]
                },
                {
                    "name": "श&#2381;र&#2368; च&#2306;द&#2381;रमण&#2367;(2)",
                    "children": [
                    {
                        "name": "श&#2381;र&#2368; ल&#2366;ल",
                        "children": [
                        {
                            "name": "र&#2366;मजस",
                            "children": [
                            {
                                "name": "उम&#2366;क&#2366;&#2306;त"
                            },
                            {
                                "name": "रम&#2366;क&#2366;&#2306;त"
                            }
                            ]
                        },
                        {
                            "name": "र&#2366;मद&#2375;व",
                            "children": [
                            {
                                "name": "क&#2371;ष&#2381;ण&#2366; क&#2369;म&#2366;र"
                            },
                            {
                                "name": "श&#2367;वम"
                            },
                            {
                                "name": "सत&#2381;यम"
                            },
                            {
                                "name": "4"
                            }
                            ]
                        },
                        {
                            "name": "मध&#2369;स&#2370;दन",
                            "children": [
                            {
                                "name": "न&#2368;ल&#2375;श"
                            },
                            {
                                "name": "र&#2366;न&#2368;(प&#2369;त&#2381;र&#2368;)"
                            },
                            {
                                "name": "व&#2367;प&#2367;न"
                            },
                            {
                                "name": "स&#2306;जय/च&#2367;कन&#2375;"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "र&#2366;मल&#2366;ल",
                        "children": [
                        {
                            "name": "जय श&#2306;कर",
                            "children": [
                            {
                                "name": "स&#2306;जय"
                            },
                            {
                                "name": "अज&#2368;त"
                            }
                            ]
                        },
                        {
                            "name": "ह&#2368;र&#2366; ल&#2366;ल",
                            "children": [
                            {
                                "name": "ग&#2380;र&#2368;(प&#2369;त&#2381;र&#2368;)"
                            },
                            {
                                "name": "आश&#2369;त&#2379;ष"
                            }
                            ]
                        },
                        {
                            "name": "हर&#2367;हर",
                            "children": [
                            {
                                "name": "र&#2366;ह&#2369;ल"
                            },
                            {
                                "name": "अम&#2367;त क&#2369;म&#2366;र"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "र&#2366;म न&#2367;ह&#2379;र",
                        "children": [
                        {
                            "name": "स&#2369;न&#2368;त&#2366;(प&#2369;त&#2381;र&#2368;)"
                        }
                        ]
                    },
                    {
                        "name": "रघ&#2369;न&#2366;थ/DADDI",
                        "children": [
                        {
                            "name": "स&#2306;त&#2379;ष",
                            "children": [
                            {
                                "name": "स&#2369;यश"
                            },
                            {
                                "name": "आय&#2369;ष&#2368;(प&#2369;त&#2381;र&#2368;)"
                            }
                            ]
                        },
                        {
                            "name": "अर&#2370;ण",
                            "children": [
                            {
                                "name": "कप&#2367;ल"
                            },
                            {
                                "name": "र&#2366;श&#2368;(प&#2369;त&#2381;र&#2368;)"
                            }
                            ]
                        },
                        {
                            "name": "व&#2367;जय",
                            "children": [
                            {
                                "name": "र&#2366;ध&#2366;(प&#2369;त&#2381;र&#2368;)"
                            },
                            {
                                "name": "हर&#2381;ष&#2368;(प&#2369;त&#2381;र&#2368;)"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "र&#2366;म&#2366;यण",
                        "children": [
                        {
                            "name": "मन&#2379;ज"
                        },
                        {
                            "name": "ज&#2381;य&#2379;त&#2367;(प&#2369;त&#2381;र&#2368;)"
                        }
                        ]
                    }
                    ]
                },
                {
                    "name": "श&#2381;र&#2368; व&#2367;श&#2381;वन&#2366;थ(2)",
                    "children": [
                    {
                        "name": "अ&#2306;ब&#2367;क&#2366;",
                        "children": [
                        {
                            "name": "ब&#2371;ज&#2375;श",
                            "children": [
                            {
                                "name": "प&#2366;र&#2381;थ/प&#2381;र&#2367;य&#2366;&#2306;श"
                            },
                            {
                                "name": "प&#2381;रज&#2381;ञ&#2366;न/श&#2367;व&#2366;&#2306;श"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "ब&#2366;ल&#2381;म&#2368;क&#2367;",
                        "children": [
                        {
                            "name": "प&#2381;रद&#2368;प",
                            "children": [
                            {
                                "name": "पल&#2381;लव&#2368;(प&#2369;त&#2381;र&#2368;)"
                            },
                            {
                                "name": "आय&#2369;ष&#2368;(प&#2369;त&#2381;र&#2368;)"
                            }
                            ]
                        },
                        {
                            "name": "आरत&#2368;(प&#2369;त&#2381;र&#2368;)"
                        },
                        {
                            "name": "स&#2306;द&#2368;प"
                        },
                        {
                            "name": "आश&#2368;ष"
                        }
                        ]
                    }
                    ]
                },
                {
                    "name": "श&#2381;र&#2368; ब&#2376;जन&#2366;थ(2)",
                    "children": [
                    {
                        "name": "श&#2381;य&#2366;म स&#2369;&#2306;दर",
                        "children": [
                        {
                            "name": "उर&#2381;म&#2367;ल&#2375;श",
                            "children": [
                            {
                                "name": "ऋष&#2367;"
                            }
                            ]
                        },
                        {
                            "name": "कमल&#2375;श",
                            "children": [
                            {
                                "name": "र&#2379;ह&#2367;त"
                            },
                            {
                                "name": "र&#2367;त&#2367;क"
                            }
                            ]
                        },
                        {
                            "name": "अख&#2367;ल&#2375;श",
                            "children": [
                            {
                                "name": "अद&#2367;त&#2367;(प&#2369;त&#2381;र&#2368;)"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "अर&#2381;ज&#2369;न",
                        "children": [
                        {
                            "name": "र&#2369;द&#2381;रद&#2375;व",
                            "children": [
                            {
                                "name": "र&#2370;ह&#2368;(प&#2369;त&#2381;र&#2368;)"
                            }
                            ]
                        },
                        {
                            "name": "अभ&#2367;मन&#2381;य&#2369;"
                        },
                        {
                            "name": "रव&#2367;"
                        }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        }
        ]
    },
    {
        "name": "महेश गौतम",
        "children": [
        {
            "name": "त्रिलोक राम"
        },
        {
            "name": "राम नाथ",
            "children": [
            {
                "name": "ईश्वर दीन",
                "children": [
                {
                    "name": "अशोक",
                    "children": [
                    {
                        "name": "राम बहादुर",
                        "children": [
                        {
                            "name": "विद्यालंकार सागर"
                        }
                        ]
                    },
                    {
                        "name": "राम उजागर",
                        "children": [
                        {
                            "name": "दिव्यराज"
                        }
                        ]
                    }
                    ]
                }
                ]
            },
            {
                "name": "कृष्ण कांत",
                "children": [
                {
                    "name": "त्रिवेणी",
                    "children": [
                        {
                            "name": "रमा(पुत्री)"
                        },
                        {
                            "name": "उमा(पुत्री)"
                        },
                        {
                            "name": "प्रज्ञा(पुत्री)"
                        },
                        {
                            "name": "प्राची(पुत्री)"
                        }
                    ]
                },
                {
                    "name": "शिवशंकर/नन्हू",
                    "children": [
                    {
                        "name": "उर्विजेश",
                        "children": [
                            {
                                "name": "हितेश"
                            }
                        ]
                    }
                    ]
                },
                {
                    "name": "कामारि",
                    "children": [
                        {
                            "name": "आदित्य",
                            "children": [
                                {
                                    "name": "आर्या(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "आशीष",
                            "children": [
                                {
                                    "name": "रुद्र"
                                }
                            ]
                        },
                        {
                            "name": "अभिषेक",
                            "children": [
                                {
                                    "name": "विश्वेश"
                                }
                            ]
                        }
                    ]
                }
                ]
            },
            {
                "name": "बुद्धसेन",
                "children": [
                    {
                        "name": "रामानुज",
                        "children": [
                        {
                            "name": "अमरनाथ",
                            "children": [
                            {
                                "name": "आयुषी(पुत्री)"
                            }
                            ]
                        },
                        {
                            "name": "हरिहर",
                            "children": [
                            {
                                "name": "रूपेश"
                            },
                            {
                                "name": "प्रशांत"
                            },
                            {
                                "name": "प्रियांशु(पुत्री)"
                            }
                            ]
                        },
                        {
                            "name": "पुष्करनाथ",
                            "children": [
                            {
                                "name": "प्रियार्षा(पुत्री)"
                            },
                            {
                                "name": "रियार्षा(पुत्री)"
                            },
                            {
                                "name": "सियार्षा(पुत्री)"
                            }
                            ]
                        },
                        {
                            "name": "अरविंद",
                            "children": [
                            {
                                "name": "दीक्षा(पुत्री)"
                            },
                            {
                                "name": "शिवांगी(पुत्री)"
                            },
                            {
                                "name": "जनमेजय"
                            },
                            {
                                "name": "विश्वाश"
                            }
                            ]
                        },
                        {
                            "name": "प्रदीप",
                            "children": [
                                {
                                    "name": "यशराज"
                                },
                                {
                                    "name": "केशवी(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "मयंक",
                            "children": [
                                {
                                    "name": "श्रेया(पुत्री)"
                                },
                                {
                                    "name": "नारायण"
                                }
                            ]
                        }
                        ]
                    }
                ]
            }
            ]
        }
        ]
    }
    ]
};