// Preparing data  
let root = {
    "name": "श्री हृदयी राम",
    "info": "Anscester",
    "children": [
    {
        "name": "श्री शिव दास",
        "children": [
        {
            "name": "श्री गणेश"
        },
        {
            "name": "श्री राम गरीब"
        }
        ]
    },
    {
        "name": "श्री शिव पाल",
        "children": [
        {
            "name": "श्री बेनी माधव",
            "children": [
            {
                "name": "राम अधीन",
                "children": [
                {
                    "name": "महादेव"
                },
                {
                    "name": "रामेश्वर"
                }
                ]
            },
            {
                "name": "राम सेवक",
                "children": [
                    {
                        "name": "बिन्द्रा राम",
                        "children": [
                        {
                            "name": "राम विशाल",
                            "children": [
                            {
                                "name": "शिव प्रसाद",
                                "children": [
                                {
                                    "name": "रमेश"
                                },
                                {
                                    "name": "राम नरेश",
                                    "children": [
                                    {
                                        "name": "संजय"
                                    },
                                    {
                                        "name": "विजय"
                                    }
                                    ]
                                },
                                {
                                    "name": "दीनेश",
                                    "children": [
                                        {
                                            "name": "नीरज"
                                        },
                                        {
                                            "name": "नीलेश"
                                        },
                                        {
                                            "name": "दीपेश"
                                        },
                                        {
                                            "name": "रोहित"
                                        }
                                    ]
                                }
                                ]
                            },
                            {
                                "name": "राम नेवाज",
                                "children": [
                                {
                                    "name": "राज कुमार",
                                    "children": [
                                        {
                                            "name": "अभिषेक"
                                        },
                                        {
                                            "name": "अनुराग"
                                        },
                                        {
                                            "name": "3"
                                        }
                                    ]
                                }
                                ]
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "बद्री राम"
                    }
                ]

            },
            {
                "name": "श्री सूर्य दीन गौतम",
                "children": [
                {
                    "name": "श्री विश्वेश्वर राम",
                    "children": [
                    {
                        "name": "श्री मनबहोर"
                    },
                    {
                        "name": "श्री लक्ष्मण प्रसाद",
                        "children": [
                        {
                            "name": "इंद्रकली(पुत्री)"
                        },
                        {
                            "name": "श्री सुरेश प्रसाद गौतम",
                            "children": [
                            {
                                "name": "सुनीता(पुत्री)"
                            },
                            {
                                "name": "दीपक",
                                "children": [
                                {
                                    "name": "आयुष"
                                },
                                {
                                    "name": "प्राची(पुत्री)"
                                }
                                ]
                            },
                            {
                                "name": "आनंद",
                                "children": [
                                {
                                    "name": "1(पुत्री)"
                                },
                                {
                                    "name": "2(पुत्री)"
                                }
                                ]
                            },
                            {
                                "name": "अनंत",
                                "children": [
                                    {
                                        "name": "1"
                                    },
                                    {
                                        "name": "2 (पुत्री)"
                                    }
                                ]
                            }
                            ]
                        },
                        {
                            "name": "श्री केशरी प्रसाद गौतम",
                            "children": [
                                {
                                    "name": "सुधा मिश्रा (शुक्ला)"
                                },
                                {
                                    "name": "आराधना मिश्रा (शुक्ला)"
                                },
                                {
                                    "name": "अर्चना मिश्रा (शुक्ला)"
                                },
                                {
                                    "name": "आरती मिश्रा (शुक्ला) (शिक्षक)"
                                },
                                {
                                    "name": "आशुतोष मिश्र",
                                    "children": [
                                        {
                                            "name": "आद्या मिश्रा"
                                        }
                                    ]
                                },
                                {
                                    "name": "आदर्श मिश्र(भूपे)",
                                    "children": [
                                        {
                                            "name": "आव्या मिश्रा"
                                        }
                                    ]
                                }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "श्री मनमोहन"
                    }
                    ]
                }
                ]
            },
            {
                "name": "श्री आनंदे राम",
                "children": [
                {
                    "name": "श्री फदाली राम"
                },
                {
                    "name": "श्री नर्वदा राम",
                    "children": [
                    {
                        "name": "श्री बलदेव"
                    },
                    {
                        "name": "श्री राम जीवन",
                        "children": [
                        {
                            "name": "श्री श्रीनिवास",
                            "children": [
                            {
                                "name": "पूनम(पुत्री)"
                            },
                            {
                                "name": "पूजा(पुत्री)"
                            },
                            {
                                "name": "त्रयंबक(पुत्र)"
                            },
                            {
                                "name": "पलक(पुत्री)"
                            },
                            {
                                "name": "झलक(पुत्री)"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "श्री यज्ञ नारायण गौतम",
                        "children": [
                        {
                            "name": "गुड्डी(पुत्री)"
                        },
                        {
                            "name": "राकेश",
                            "children": [
                                {
                                    "name": "ऋषभ"
                                },
                                {
                                    "name": "1"
                                }
                            ]
                        },
                        {
                            "name": "पवन",
                            "children": [
                                {
                                    "name": "देवांश"
                                }
                            ]
                        },
                        {
                            "name": "घनश्‍याम",
                            "children": [
                                {
                                    "name": "दिव्यांश"
                                }
                            ]
                        },
                        {
                            "name": "पंकज (पुत्री)"
                        },
                        ]
                    },
                    {
                        "name": "श्री राम नारायण"
                    }
                    ]
                }
                ]
            },
            {
                "name": "श्री परम सुख",
                "children": [
                {
                    "name": "जमुनाराम",
                    "children": [
                    {
                        "name": "जगदीश प्रसाद",
                        "children": [
                            {
                                "name": "मांडवी(पुत्री)"
                            }
                        ]
                    },
                    {
                        "name": "राम गोपाल",
                        "children": [
                        {
                            "name": "श्री संपाती/सम्पति",
                            "children": [
                                {
                                    "name": "वर्षा(पुत्री)"
                                },
                                {
                                    "name": "सुषमा(पुत्री)"
                                },
                                {
                                    "name": "सुमन(पुत्री)"
                                },
                                {
                                    "name": "ओम प्रकाश"
                                },
                                {
                                    "name": "जय प्रकाश"
                                }
                            ]
                        },
                        {
                            "name": "श्री दयाशंकर",
                            "children": [
                                {
                                    "name": "मीरा(पुत्री)"
                                },
                                {
                                    "name": "अजय",
                                    "children": [
                                    {
                                        "name": "पार्थ(पुत्र)"
                                    }
                                    ],
                                },
                                {
                                    "name": "राधा(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "श्री रावेंद्र",
                            "children": [
                            {
                                "name": "शालू(पुत्री)"
                            },
                            {
                                "name": "सौरभ"
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "राम मिलन",
                        "children": [
                        {
                            "name": "गिरिजा",
                            "children": [
                                {
                                    "name": "विवेक"
                                },
                                {
                                    "name": "अभिषेक"
                                }
                            ]
                        },
                        {
                            "name": "शिव शंकर",
                            "children": [
                                {
                                    "name": "आदित्य"
                                },
                                {
                                    "name": "नेहा(पुत्री)"
                                }
                            ]
                        }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        },
        {
            "name": "श्री गंगा राम",
            "children": [
            {
                "name": "श्री नन्द किशोर",
                "children": [
                {
                    "name": "श्री शोभनाथ(1)",
                    "children": [
                    {
                        "name": "चंद्र शेखर",
                        "children": [
                        {
                            "name": "शेषमणि",
                            "children": [
                            {
                                "name": "महेन्द्र",
                                "children": [
                                    {
                                        "name": "नेहा(पुत्री)"
                                    },
                                    {
                                        "name": "निखिल"
                                    },
                                    {
                                        "name": "नीतेश"
                                    }
                                ]
                            }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "शम्भू",
                        "children": [
                            {
                                "name": "इन्द्रसेन (-1)"
                            }
                        ]
                    }
                    ]
                },
                {
                    "name": "श्री राम प्रगास(1)",
                    "children": [
                        {
                            "name": "शुभउवा(पुत्री)"
                        },
                        {
                            "name": "रजनी(पुत्री)"
                        }
                    ]
                },
                {
                    "name": "श्री चंद्रमणि(2)",
                    "children": [
                        {
                            "name": "श्री लाल",
                            "children": [
                                {
                                    "name": "रामजस",
                                    "children": [
                                    {
                                        "name": "उमाकांत"
                                    },
                                    {
                                        "name": "रमाकांत"
                                    }
                                    ]
                                },
                                {
                                    "name": "रामदेव",
                                    "children": [
                                    {
                                        "name": "कृष्णा कुमार"
                                    },
                                    {
                                        "name": "शिवम"
                                    },
                                    {
                                        "name": "सत्यम"
                                    },
                                    {
                                        "name": "4"
                                    }
                                    ]
                                },
                                {
                                    "name": "मधुसूदन",
                                    "children": [
                                        {
                                            "name": "नीलेश"
                                        },
                                        {
                                            "name": "रानी(पुत्री)"
                                        },
                                        {
                                            "name": "विपिन"
                                        },
                                        {
                                            "name": "संजय/चिकने"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "रामलाल",
                            "children": [
                            {
                                "name": "जय शंकर",
                                "children": [
                                    {
                                        "name": "संजय"
                                    },
                                    {
                                        "name": "अजीत"
                                    }
                                ]
                            },
                            {
                                "name": "हीरा लाल",
                                "children": [
                                    {
                                        "name": "गौरी(पुत्री)"
                                    },
                                    {
                                        "name": "आशुतोष"
                                    }
                                ]
                            },
                            {
                                "name": "हरिहर",
                                "children": [
                                    {
                                        "name": "राहुल"
                                    },
                                    {
                                        "name": "अमित कुमार"
                                    }
                                ]
                            }
                            ]
                        },
                        {
                            "name": "राम निहोर",
                            "children": [
                                {
                                    "name": "सुनीता(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "रघुनाथ/DADDI",
                            "children": [
                            {
                                "name": "संतोष",
                                "children": [
                                    {
                                        "name": "सुयश"
                                    },
                                    {
                                        "name": "आयुषी(पुत्री)"
                                    }
                                ]
                            },
                            {
                                "name": "अरूण",
                                "children": [
                                    {
                                        "name": "कपिल"
                                    },
                                    {
                                        "name": "राशी(पुत्री)"
                                    }
                                ]
                            },
                            {
                                "name": "विजय",
                                "children": [
                                    {
                                        "name": "राधा(पुत्री)"
                                    },
                                    {
                                        "name": "हर्षी(पुत्री)"
                                    }
                                ]
                            }
                            ]
                        },
                        {
                            "name": "रामायण",
                            "children": [
                                {
                                    "name": "मनोज"
                                },
                                {
                                    "name": "ज्योति(पुत्री)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "श्री विश्वनाथ(2)",
                    "children": [
                    {
                        "name": "अंबिका",
                        "children": [
                        {
                            "name": "बृजेश",
                            "children": [
                                {
                                    "name": "पार्थ/प्रियांश"
                                },
                                {
                                    "name": "प्रज्ञान/शिवांश"
                                }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "बाल्मीकि",
                        "children": [
                        {
                            "name": "प्रदीप",
                            "children": [
                                {
                                    "name": "पल्लवी(पुत्री)"
                                },
                                {
                                    "name": "आयुषी(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "आरती(पुत्री)"
                        },
                        {
                            "name": "संदीप",
                            "children": [
                                {
                                    "name": "1"
                                },
                                {
                                    "name": "2"
                                }
                            ]
                        },
                        {
                            "name": "आशीष",
                            "children": [
                                {
                                    "name": "1"
                                }
                            ]
                        }
                        ]
                    }
                    ]
                },
                {
                    "name": "श्री बैजनाथ(2)",
                    "children": [
                    {
                        "name": "श्याम सुंदर",
                        "children": [
                        {
                            "name": "उर्मिलेश",
                            "children": [
                                {
                                    "name": "ऋषि"
                                }
                            ]
                        },
                        {
                            "name": "कमलेश",
                            "children": [
                                {
                                    "name": "रोहित"
                                },
                                {
                                    "name": "रितिक"
                                }
                            ]
                        },
                        {
                            "name": "अखिलेश",
                            "children": [
                                {
                                    "name": "अदिति(पुत्री)"
                                }
                            ]
                        }
                        ]
                    },
                    {
                        "name": "अर्जुन",
                        "children": [
                            {
                                "name": "रुद्रदेव",
                                "children": [
                                    {
                                        "name": "रूही(पुत्री)"
                                    }
                                ]
                            },
                            {
                                "name": "अभिमन्यु"
                            },
                            {
                                "name": "रवि"
                            }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        }
        ]
    },
    {
        "name": "महेश गौतम",
        "children": [
        {
            "name": "त्रिलोक राम"
        },
        {
            "name": "राम नाथ",
            "children": [
            {
                "name": "ईश्वर दीन",
                "children": [
                {
                    "name": "अशोक",
                    "children": [
                    {
                        "name": "राम बहादुर",
                        "children": [
                        {
                            "name": "विद्यालंकार सागर"
                        }
                        ]
                    },
                    {
                        "name": "राम उजागर",
                        "children": [
                        {
                            "name": "दिव्यराज"
                        }
                        ]
                    }
                    ]
                }
                ]
            },
            {
                "name": "कृष्ण कांत",
                "children": [
                {
                    "name": "त्रिवेणी",
                    "children": [
                        {
                            "name": "रमा(पुत्री)"
                        },
                        {
                            "name": "उमा(पुत्री)"
                        },
                        {
                            "name": "प्रज्ञा(पुत्री)"
                        },
                        {
                            "name": "प्राची(पुत्री)"
                        }
                    ]
                },
                {
                    "name": "शिवशंकर/नन्हू",
                    "children": [
                    {
                        "name": "उर्विजेश",
                        "children": [
                            {
                                "name": "हितेश"
                            }
                        ]
                    }
                    ]
                },
                {
                    "name": "कामारि",
                    "children": [
                        {
                            "name": "आदित्य",
                            "children": [
                                {
                                    "name": "आर्या(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "आशीष",
                            "children": [
                                {
                                    "name": "रुद्र"
                                }
                            ]
                        },
                        {
                            "name": "अभिषेक",
                            "children": [
                                {
                                    "name": "विश्वेश"
                                }
                            ]
                        }
                    ]
                }
                ]
            },
            {
                "name": "बुद्धसेन",
                "children": [
                    {
                        "name": "रामानुज",
                        "children": [
                        {
                            "name": "अमरनाथ",
                            "children": [
                            {
                                "name": "आयुषी(पुत्री)"
                            }
                            ]
                        },
                        {
                            "name": "हरिहर",
                            "children": [
                            {
                                "name": "रूपेश"
                            },
                            {
                                "name": "प्रशांत"
                            },
                            {
                                "name": "प्रियांशु(पुत्री)"
                            }
                            ]
                        },
                        {
                            "name": "पुष्करनाथ",
                            "children": [
                            {
                                "name": "प्रियार्षा(पुत्री)"
                            },
                            {
                                "name": "रियार्षा(पुत्री)"
                            },
                            {
                                "name": "सियार्षा(पुत्री)"
                            }
                            ]
                        },
                        {
                            "name": "अरविंद",
                            "children": [
                            {
                                "name": "दीक्षा(पुत्री)"
                            },
                            {
                                "name": "शिवांगी(पुत्री)"
                            },
                            {
                                "name": "जनमेजय"
                            },
                            {
                                "name": "विश्वाश"
                            }
                            ]
                        },
                        {
                            "name": "प्रदीप",
                            "children": [
                                {
                                    "name": "यशराज"
                                },
                                {
                                    "name": "केशवी(पुत्री)"
                                }
                            ]
                        },
                        {
                            "name": "मयंक",
                            "children": [
                                {
                                    "name": "श्रेया(पुत्री)"
                                },
                                {
                                    "name": "नारायण"
                                }
                            ]
                        }
                        ]
                    }
                ]
            }
            ]
        }
        ]
    }
    ]
};